# practice2.py

# 1. 연도를 입력 받아 윤년인지 아닌지 출력
'''
    * 윤년 판별 기준
      - 연도가 4의 배수이면 윤년
        이때, 100의 배수이면 윤년이 아님
        하지만, 400의 배수이면 윤년

                    4의 배수     100의 배수     400의 배수      윤년 여부
      ex) 2020  =>     O           X             X              O
          1900  =>     O           O             X              X
          2000  =>     O           O             O              O
          2023  =>     X           X             X              X

'''

while True:
  num = input("몇년??: ")

  if not num.isdigit():
      print("다시 입력 ㄱㄱ")
      print()
      continue
  
  num = int(num)
  break

if num % 400 == 0:
    print("윤년임")
elif num % 100 == 0:
    print("윤년아님")
elif num % 4 == 0:
    print("윤년임")
else:
    print("윤년아님...")

'''
if (num % 4 == 0 and num % 100 != 0) or num % 400 == 0:
    print("윤년임")
else:
    print("윤년아님..")
'''

print()

# 2. 1 ~ 100 까지의 3의 배수 합 출력
sum = 0
for i in range(0, 100, 3):
    sum += i

print(f"1부터 100까지 값 중 3의 배수 총 합 : {sum}")


# 3. 구구단 출력 (2단 ~ 9단)
'''  **** 출력 형식 ****
    2 x 1 = 2   3 x 1 = 3   4 x 1 = 4   ...  9 x 1 = 9
    2 x 2 = 4   3 x 2 = 6   4 x 2 = 8   ...  9 x 2 = 18
    2 x 3 = 6   3 x 3 = 9   4 x 3 = 12   ...  9 x 3 = 27
    ...
    2 x 9 = 18   3 x 9 = 27   4 x 9 = 36   ...  9 x 9 = 81
'''

for i in range(2, 10):
    for j in range(2, 10):
        num = i * j
        print(f"{i} x {j} = {num}", end = " ")
    print()


# 4. 문자열을 입력 받아 길이가 5 이상이면 "길어요" 출력. 그렇지 않으면
# 입력된 값 출력
str = input("단어 입력: ")

if len(str) >= 5:
    print("길어용")
else:
    print(str)

# 5. 1 ~ 31까지 숫자를 모두 출력하되, 값에 3 또는 6 또는 9가 포함된 경우 "짝👏" 출력

for i in range(1, 32):
    num = str(i)
    if "3" not in num and "6" not in num and "9" not in num:
      print(f"{i}", end = " ")
    else:
      print("짝", end = " ")

    if i % 10 == 0:
      print()
    